// backend/constants.js

const SYMBOL_MAP = {
    "a": "α", "b": "β", "c": "¢", "d": "δ", "e": "ε", "f": "ϝ",
    "g": "ɡ", "h": "♄", "i": "ι", "j": "ʆ", "k": "κ", "l": "λ",
    "m": "ɱ", "n": "η", "o": "☺", "p": "ρ", "q": "φ", "r": "я",
    "s": "ѕ", "t": "τ", "u": "υ", "v": "ν", "w": "ω", "x": "х",
    "y": "γ", "z": "ζ"
  };
  
  const UPPER_SYMBOL_MAP = {
    "A": "Α", "B": "Β", "C": "¢", "D": "Δ", "E": "Ε", "F": "ϝ",
    "G": "ɡ", "H": "♄", "I": "ι", "J": "ʆ", "K": "κ", "L": "λ",
    "M": "ɱ", "N": "η", "O": "☺", "P": "ρ", "Q": "φ", "R": "я",
    "S": "ѕ", "T": "τ", "U": "υ", "V": "ν", "W": "ω", "X": "х",
    "Y": "γ", "Z": "ζ"
  };
  
  const REVERSE_MAP_SYMBOL = {
    "α": "a", "β": "b", "¢": "c", "δ": "d", "ε": "e", "ϝ": "f",
    "ɡ": "g", "♄": "h", "ι": "i", "ʆ": "j", "κ": "k", "λ": "l",
    "ɱ": "m", "η": "n", "☺": "o", "ρ": "p", "φ": "q", "я": "r",
    "ѕ": "s", "τ": "t", "υ": "u", "ν": "v", "ω": "w", "х": "x",
    "γ": "y", "ζ": "z",
    "Α": "A", "Β": "B", "Δ": "D", "Ε": "E"
  };
  
  const PUNCTUATION_CHARS = ".,!?;:'\"@#$%^&*()-_=+[]{}|\\/<>~`";
  
  module.exports = {
    SYMBOL_MAP,
    UPPER_SYMBOL_MAP,
    REVERSE_MAP_SYMBOL,
    PUNCTUATION_CHARS
  };
  